logs/producerPerf_compression.log
[compression.type=none]
2022-05-09 02:54
7396 records sent, 1479.2 records/sec (1.44 MB/sec), 2255.2 ms avg latency, 4153.0 ms max latency.
24370 records sent, 4870.1 records/sec (4.76 MB/sec), 6761.6 ms avg latency, 8397.0 ms max latency.
21839 records sent, 4367.8 records/sec (4.27 MB/sec), 6548.7 ms avg latency, 8385.0 ms max latency.
24787 records sent, 4957.4 records/sec (4.84 MB/sec), 6315.8 ms avg latency, 6848.0 ms max latency.
100000 records sent, 4092.657772 records/sec (4.00 MB/sec), 6120.86 ms avg latency, 8397.00 ms max latency, 6283 ms 50th, 7991 ms 95th, 8323 ms 99th, 8390 ms 99.9th.

[compression.type=gzip]
2022-05-09 02:58
8795 records sent, 1759.0 records/sec (1.72 MB/sec), 2162.6 ms avg latency, 3733.0 ms max latency.
21023 records sent, 4204.6 records/sec (4.11 MB/sec), 5961.9 ms avg latency, 7150.0 ms max latency.
25107 records sent, 5021.4 records/sec (4.90 MB/sec), 6293.5 ms avg latency, 7569.0 ms max latency.
18765 records sent, 3753.0 records/sec (3.67 MB/sec), 7258.6 ms avg latency, 7837.0 ms max latency.
23834 records sent, 4766.8 records/sec (4.66 MB/sec), 6955.1 ms avg latency, 7811.0 ms max latency.
100000 records sent, 3901.829958 records/sec (3.81 MB/sec), 6200.65 ms avg latency, 7837.00 ms max latency, 6440 ms 50th, 7688 ms 95th, 7828 ms 99th, 7835 ms 99.9th.

[compression.type=snappy]
2022-05-09 02:56
2409 records sent, 481.8 records/sec (0.47 MB/sec), 3425.4 ms avg latency, 4154.0 ms max latency.
18964 records sent, 3792.8 records/sec (3.70 MB/sec), 6690.3 ms avg latency, 8192.0 ms max latency.
17694 records sent, 3538.8 records/sec (3.46 MB/sec), 7944.4 ms avg latency, 9371.0 ms max latency.
23842 records sent, 4768.4 records/sec (4.66 MB/sec), 7309.1 ms avg latency, 8122.0 ms max latency.
26099 records sent, 5219.8 records/sec (5.10 MB/sec), 6783.9 ms avg latency, 7987.0 ms max latency.
100000 records sent, 3700.551382 records/sec (3.61 MB/sec), 6904.61 ms avg latency, 9371.00 ms max latency, 7095 ms 50th, 8669 ms 95th, 9227 ms 99th, 9358 ms 99.9th.