logs/producerPerf_linger-ms.log
[linger.ms=0]
2022-05-09 02:24
12533 records sent, 2506.6 records/sec (0.24 MB/sec), 2430.3 ms avg latency, 4266.0 ms max latency.
21321 records sent, 4264.2 records/sec (0.41 MB/sec), 6391.5 ms avg latency, 8310.0 ms max latency.
17513 records sent, 3502.6 records/sec (0.33 MB/sec), 10223.8 ms avg latency, 12440.0 ms max latency.
25210 records sent, 5042.0 records/sec (0.48 MB/sec), 14489.8 ms avg latency, 16183.0 ms max latency.
100000 records sent, 4117.768170 records/sec (0.39 MB/sec), 11265.56 ms avg latency, 19277.00 ms max latency, 12283 ms 50th, 18651 ms 95th, 19138 ms 99th, 19246 ms 99.9th.

[linger.ms=10]
2022-05-09 02:27
10807 records sent, 2161.4 records/sec (0.21 MB/sec), 2508.5 ms avg latency, 3966.0 ms max latency.
27700 records sent, 5540.0 records/sec (0.53 MB/sec), 6044.7 ms avg latency, 8077.0 ms max latency.
24886 records sent, 4977.2 records/sec (0.47 MB/sec), 10042.4 ms avg latency, 11832.0 ms max latency.
29191 records sent, 5838.2 records/sec (0.56 MB/sec), 13617.9 ms avg latency, 15383.0 ms max latency.
100000 records sent, 4698.364969 records/sec (0.45 MB/sec), 9593.57 ms avg latency, 16278.00 ms max latency, 9899 ms 50th, 15668 ms 95th, 16173 ms 99th, 16268 ms 99.9th.

[linger.ms=100]
2022-05-09 02:28
14154 records sent, 2830.8 records/sec (0.27 MB/sec), 2562.6 ms avg latency, 4164.0 ms max latency.
27566 records sent, 5513.2 records/sec (0.53 MB/sec), 6101.1 ms avg latency, 7905.0 ms max latency.
23682 records sent, 4736.4 records/sec (0.45 MB/sec), 9634.6 ms avg latency, 11736.0 ms max latency.
18791 records sent, 3758.2 records/sec (0.36 MB/sec), 13903.7 ms avg latency, 15801.0 ms max latency.
100000 records sent, 4293.135277 records/sec (0.41 MB/sec), 9611.99 ms avg latency, 18284.00 ms max latency, 9119 ms 50th, 17319 ms 95th, 17987 ms 99th, 18270 ms 99.9th.