logs/producerPerf_record-size.log
[record-size=100]
2022-05-09 02:33
10510 records sent, 2102.0 records/sec (0.20 MB/sec), 2205.7 ms avg latency, 4315.0 ms max latency.
26420 records sent, 5284.0 records/sec (0.50 MB/sec), 6307.8 ms avg latency, 8159.0 ms max latency.
21365 records sent, 4270.4 records/sec (0.41 MB/sec), 10189.2 ms avg latency, 12097.0 ms max latency.
25241 records sent, 5048.2 records/sec (0.48 MB/sec), 14042.4 ms avg latency, 15840.0 ms max latency.
100000 records sent, 4351.988859 records/sec (0.42 MB/sec), 10397.13 ms avg latency, 17972.00 ms max latency, 10663 ms 50th, 17353 ms 95th, 17828 ms 99th, 17952 ms 99.9th.

[record-size=512]
2022-05-09 02:35
14884 records sent, 2976.8 records/sec (1.45 MB/sec), 2308.2 ms avg latency, 4172.0 ms max latency.
27367 records sent, 5473.4 records/sec (2.67 MB/sec), 6164.9 ms avg latency, 7894.0 ms max latency.
25021 records sent, 5004.2 records/sec (2.44 MB/sec), 9409.3 ms avg latency, 10789.0 ms max latency.
21463 records sent, 4292.6 records/sec (2.10 MB/sec), 11035.9 ms avg latency, 11601.0 ms max latency.
100000 records sent, 4449.586188 records/sec (2.17 MB/sec), 8103.02 ms avg latency, 12216.00 ms max latency, 8840 ms 50th, 12123 ms 95th, 12188 ms 99th, 12214 ms 99.9th.

[record-size=1024]
2022-05-09 02:36
14372 records sent, 2874.4 records/sec (2.81 MB/sec), 2413.8 ms avg latency, 3629.0 ms max latency.
28393 records sent, 5678.6 records/sec (5.55 MB/sec), 5248.5 ms avg latency, 6171.0 ms max latency.
17731 records sent, 3546.2 records/sec (3.46 MB/sec), 6148.9 ms avg latency, 7128.0 ms max latency.
27188 records sent, 5437.6 records/sec (5.31 MB/sec), 7036.7 ms avg latency, 7565.0 ms max latency.
100000 records sent, 4449.388209 records/sec (4.35 MB/sec), 5531.68 ms avg latency, 7565.00 ms max latency, 5745 ms 50th, 7504 ms 95th, 7543 ms 99th, 7564 ms 99.9th.